mutants/patches/capture-witness-names-the-target-not-the-root.patch
diff --git a/Sources/SwiftEffectInference/PurityInferrer.swift b/Sources/SwiftEffectInference/PurityInferrer.swift
index 9e21c10..11f3d1e 100644
--- a/Sources/SwiftEffectInference/PurityInferrer.swift
+++ b/Sources/SwiftEffectInference/PurityInferrer.swift
@@ -747,7 +747,7 @@ private final class CaptureMutationChecker: SourceAccurateSyntaxVisitor {
     private func refuteIfCaptured(_ target: ExprSyntax) {
         guard let root = rootName(of: target) else { return }
         guard !locallyBound.contains(root), !Self.isShorthandParameter(root) else { return }
-        if mutatedName == nil { mutatedName = root }
+        if mutatedName == nil { mutatedName = target.trimmedDescription }
     }
 
     /// `$0`, `$1`, … — a shorthand parameter is by construction bound by *some* enclosing closure and
